Public Attributes | List of all members
API_OpeningReferenceAxisParameters Struct Reference
Element Manager API
Opening floor plan and section reference axis parameters. More...
#include <APIdefs_Elements.h>
 Public Attributes
bool  | showReferenceAxis
Show reference axis.
short  | referenceAxisPenIndex
Reference axis pen index.
API_AttributeIndex  | referenceAxisLineTypeIndex
Reference axis line type.
double  | referenceAxisOverhang
Reference axis overhang.
Detailed Description
Opening floor plan and section reference axis parameters.
Member Data Documentation
◆ referenceAxisLineTypeIndex
 API_OpeningReferenceAxisParameters::referenceAxisLineTypeIndex
Reference axis line type.
◆ referenceAxisOverhang
 API_OpeningReferenceAxisParameters::referenceAxisOverhang
Reference axis overhang.
◆ referenceAxisPenIndex
 API_OpeningReferenceAxisParameters::referenceAxisPenIndex
Reference axis pen index.
◆ showReferenceAxis
 API_OpeningReferenceAxisParameters::showReferenceAxis
Show reference axis.